{
    "Q1": {
        "question": "Can you observe the fundamental transition for Hydrogen gas using infrared spectroscopy? Explain your answer.",
        "concepts_tested": [
            "Molecular Symmetry and Dipole Moment",
            "Vibrational Transitions in IR Spectroscopy",
            "Coupling of electromagnetic field oscillations with vibrations in the molecule"
        ],
        "good_answer": "Infrared spectroscopy relies on the interaction between molecular vibrations and the oscillating electric field of infrared light, requiring a molecule to have a dipole moment. During a vibrational transition, if this dipole moment changes, it can couple with the IR light's electric field, and this coupling allows the light to affect the dipole moment of the molecule. The effectiveness of this coupling, and thus the intensity of IR absorption, depends on the matching of the IR light's frequency with the molecule's vibrational frequency. However, molecular hydrogen (H2), being a homonuclear diatomic molecule, has no permanent dipole moment due to its symmetric electronic distribution, and its vibrational transitions do not result in a change in dipole moment. Consequently, there is no mechanism for coupling H2's vibrations with the electromagnetic field, leading to its absence in IR absorption spectra. Essentially, H2 does not interact with infrared light because there are no dipole moment changes to couple with the oscillating electromagnetic field.",
        "common_mistakes": [
            "The student may not understand that as H2 is a homonuclear diatomic molecule it has no dipole moment.",
            "The student may not understand that vibrations in a molecule's dipole moment can be coupled with vibrations of the electromagnetic field.",
            "The student may not understand that IR spectroscopy requires the molecule to have a dipole moment for any absorption to take place."
        ]
    },
    "Q2": {
        "question": "State why two wave functions of the same system must be orthogonal.",
        "concepts_tested": [
            "Postulates of Quantum Mechanics.",
            "If two different eigenstates correspond to different eigenvalues of the same observable, they must be orthogonal.",
            "Inner product of Hilbert space being zero reflecting zero probability of transition between two states.",
            "Mutually exclusive states - non-overlapping possible outcomes of a measurement."
        ],
        "good_answer": "The requirement that two wave functions of the same system must be orthogonal is a direct consequence of the postulates of quantum mechanics. Each wave function represents a possible state of a system, and these states are characterized mathematically by their eigenstates when associated with a particular observable represented by a Hermitian operator. It can be mathematically proven that, at least for a non-degenerate system, that following the postulates the eigenfunctions of a system must be orthonormal and that the inner product of two eigenstates must therefore be zero. In practical terms, if the product between two eigenstates is non-zero, it suggests that the states are overlapping and not entirely distinct. Without the requirement of orthogonality we would not be able to use quantum mechanics to make consistent predictions.",
        "common_mistakes": [
            "The student may not understand that the requirement of orthogonality follows directly from the postulates of quantum mechanics leading to the requirement that the inner product of the eigenstates be zero.",
            "The student may not understand that the inner product can only be zero if the states are orthogonal.",
            "The student may mistakenly believe that the need for orthogonality requirement is related to a some physical law (e.g. “an electron cannot be in two state at once”, “a particle cannot be in two places at the same time”) or confusing the mathematical requirement with other unrelated concepts (e.g. Heisenberg's uncertainty principle)."
        ]
    },
    "Q3": {
        "question": "Given, $E_v = h(v+1/2)$ explain the terms in this equation. Explain how this equation is developed, invoking our 5 fundamental rules of quantum mechanics. (You are not expected to do an explicit mathematical derivation).",
        "concepts_tested": [
            "Recognition of eigenvalue for simple harmonic oscillator.",
            "Knowledge of five key rules in the application of quantum mechanics to physical systems. 1) Classical Description: Define the system's energy using classical physics. 2) Quantum Operators: Replace each physical observable (e.g., momentum, position) with its corresponding quantum mechanical operator. 3) Hamiltonian Development: Construct the Hamiltonian operator from the kinetic and potential energies, using the operators from rule two. 4)Schrödinger Equation: Insert the Hamiltonian into the Schrödinger equation and solve for the wavefunction, which serves as the eigenfunction. 5) Boundary Conditions: Adjust the solution to satisfy the system's boundary conditions, ensuring all probabilities sum to unity"
        ],
        "good_answer": "In the equation, $E_v = h(v+1/2)$ we can describe the terms as follows: $E_v$ is the eigenvalue for energy for the simple harmonic oscillator as described with quantum mechanics, $h$ is Planck's Constant, $nu$ is the frequency of the oscillation of the simple harmonic oscillator, $v$  is the quantum number that results mathematically from the solution to the Schrödinger equation for the harmonic oscillator.\nIn our application of quantum mechanics, we follow five key rules:  \n- Classical Description: Define the system's energy using classical physics.\n- Quantum Operators: Replace each physical observable (e.g., momentum, position) with its corresponding quantum mechanical operator.\n- Hamiltonian Development: Construct the Hamiltonian operator from the kinetic and potential energies, using the operators from rule two.\n- Schrödinger Equation: Insert the Hamiltonian into the Schrödinger equation and solve for the wavefunction, which serves as the eigenfunction.\n- Boundary Conditions: Adjust the solution to satisfy the system's boundary conditions, ensuring all probabilities sum to unity. \nThe wavefunction, when applied to the Schrödinger equation, determines the total energy Ev representing the eigenvalue of the system.",
        "common_mistakes": [
            "The student wrongly connects the energy of the photon with the energy of the system to which we are providing a quantum mechanical description.",
            "The student does not recognize the equation above is the eigenvalue associated with the simple harmonic oscillator. In that case they are unable to connect the rest of the problem to the simple harmonic oscillator.",
            "The student’s answer is incomplete because they only describe one or two of the rules, for example they may describe the kinetic and potential energy classically, but they neglect to describe that quantum mechanical operators need to be introduced for momentum and for position, respectively."
        ]
    }
}