{
    "Q1": {
        "student_1": "Yes, the fundamental transition corresponds to a wavelength in the IR region of the electromagnetic spectrum.",
        "student_2": "No it is out of range of IR spectroscopy.",
        "student_3": "Yes, hydrogen is still absorbing and emitting energies.",
        "student_4": "To observe an H gas transition with IR a high-powered IR needs to be used since its transition energy is high.",
        "student_5": "Yes, because the fundamental transition occurs at 2301 nm for the process.",
        "student_6": "No, there is no change in dipole moment.",
        "student_7": "No, because hydrogen gas does not have a dipole. A dipole is required to view it in spectroscopy.",
        "student_8": "No, to observe the transition using IR spectroscopy the molecule needs to possess a permanent dipole that will allow the molecule to interact with oscillating electromagnetic spectrum. Hydrogen does not have a dipole because it's a Homo diatomic molecule.",
        "student_9": "Yes, because it will limit energy that can be picked up on IR.",
        "student_10": "You cannot see the transition. This is because it lacks the dipole moment necessary for IR to pick up a signal.",
        "student_11": "No, there is only one degree of freedom, so 1J value.",
        "student_12": "You cannot observe the fundamental transition for hydrogen as it doesn't absorb enough IR to show up."
    },
    "Q2": {
        "student_1": "Two wave functions of the same system must be orthogonal as the system would exist in multiple conditions if it did not.",
        "student_2": "They must be orthonormal because of the Heisenberg uncertainty principle.",
        "student_3": "For the probability description to work out and be coherent or make sense. Must cancel out at inverse energies",
        "student_4": "The wave functions of the same system must be orthogonal so they can't exist at the same time.",
        "student_5": "They must be orthogonal because a particle cannot be in two places or states at the same time. it is the mathematical way of proving this. Therefore, it must be true for two wave functions in the same system.",
        "student_6": "If they are not orthogonal, then there would be two wave functions operate, occupying the same space which is impossible. The wave function must not be interfered with by the other.",
        "student_7": "A system cannot be in two quantum levels at once so the probability must be zero.",
        "student_8": "They must be orthogonal because if they had cannot equal the same thing twice.",
        "student_9": "Two wave functions of the same system must be orthogonal because a particle cannot be described as being in two different places at once.",
        "student_10": "Must describe all atoms.",
        "student_11": "Two wave functions cannot occupy the same space so their overlap must be zero, the definition of orthogonality.",
        "student_12": "The probability of an electron being in both places must be zero."
    },
    "Q3": {
        "student_1": "h is the hamiltonian operator",
        "student_2": "h is the planck constant, v is the velocity and E_v is the corresponding energy. $\nu$ is the frequency of the system. it is developed by describing the energy to transition between quantum numbers classically. $h\\\\nu$ is the energy classically. Then it is substituted into the Schrodinger equation and a value of plus half is added to the energy level since $\\\\nu$ is equal to ±1/2 and it is a vibrational energy change.",
        "student_3": "$E_v$ is the energy of the system; h$\nu$ describes the 'packets' of energy; frequency observed and planck's constant are the coefficient to the parenthesized term $(v+1/2)$, where v=0,1,2,... to show that vthese energies are quantized , that is equally spaced. This equation uses the classical description of a harmonic oscillator, substituting quantum operators and using the schrodinger equation",
        "student_4": "These terms result in quantized solutions of energy. $\\\\nu$ is frequency. $v$ is speed? schrodinger equation for harmonic oscillator",
        "student_5": "$h=$ planck's constant, $v$ is frequency, $E_v$ is energy and $\\\\nu$ is the energy level. This equation is developed by the first few rules. The system’s energy needs to be explained classically. Then operators need to be introduced. After this, the Schrodinger equation can be built and solved with the follow up of boundary conditions.",
        "student_6": "$h=$ planck's constant, $(v+1/2)$ is the vibrational level term, $E_v$ is energy at vibrational level $v$ and $\\\\nu$ is the wavelength of light emitted.It is found by defining the kinetic and potential energy of an oscillator and plugging that into the Schrodinger equation.",
        "student_7": "$h=$ planck's constant, $(v+1/2)$ is the vibrational level term, $E_v$ is energy at vibrational level $v$ and $\\\\nu$ is the frequency. You start with the classical physics equation. Put in operators and convert to quantum mechanics. Input in Schrodinger equation. Solve equation. Apply the boundary conditions.",
        "student_8": "$h$ is planck's constant, $E_v$ is energy, v is quantum number and $\\\\nu$ is the frequency. The equation is based on a classical physics equation and variables that can be observed or replaced with quantum numbers. The Schrodinger equation is then built and solved, followed by boundary conditions being added.",
        "student_9": "$h$ is planck's constant, $E_v$ is energy at vibrational level $v$ and $\\\\nu$ is the frequency. This equation was derived classically from Hooke’s law. The H ̂ was used. A Schrodinger equation.",
        "student_10": "$h\nu$ is the energy, v is the velocity of the wave function eigenvalue standardized at $1/2$ because it can't be zero. First $E=h\\\\nu$",
        "student_11": "$h$ is planck's constant, $E_v$ is energy, v is quantum number and $\nu$ is the frequency. It is developed by describing the energy to transition between quantum numbers classically. hν is the energy classically. Then it is substituted into the Schrodinger equation and a value of plus half is added to the energy level since ν is equal to ±1/2 and it is a vibrational energy change."
    },
    "Q7_41A": {
        "student_1": "I think current is just the amount of charge passing a point, so it's probably just e because that's the charge of an electron, right? So, I = 1.6 x 10^-19 coulombs.",
        "student_2": "Current is like, charge over time? So, I = e/T, and T is... umm, maybe just the velocity or something? So, I = 1.6 x 10^-19 / 2.2 x 10^6?",
        "student_3": "Current is when electrons move, and since one electron is moving here, it's just the electron's charge, e.",
        "student_4": "Current is in amperes, which is coulombs per second. The electron goes around once per second, right? So it's just 1.6 x 10^-19 A?"
    },
    "Q7_41B": {
        "student_1": "Magnetic moment is like magnet stuff So maybe it's just the charge times the velocity. So, m=e×vm=e×v or something.",
        "student_2": "I think the magnetic moment is something to do with magnets? Maybe you multiply the charge by the radius because the radius is where the electron is? So, m=e x rm=e x r?",
        "student_3": "I'm not sure what a magnetic moment is, but maybe it has to do with the speed of the electron because it's moving? So maybe m=vm=v or m=v×em=v×e?",
        "student_4": "Isn't the magnetic moment something with loops and current? Maybe it's like the area of the circle times the charge? So, m = pi r^2 x e?"
    },
    "Q7_41C": {
        "student_1": "For the magnetic moment, I think it’s like the charge times the radius, because it's something magnetic and stuff, so m = e x r.",
        "student_2": "Angular momentum is tricky, but I guess it’s just the velocity times the radius since that sounds right. So, L = v x r.",
        "student_3": "If it's going anticlockwise, the angular momentum is probably just straight up along the z-axis because it sounds right that it goes upwards.",
        "student_4": "For the vector, since position is r i and velocity is v j, I think you just add them for angular momentum, like L = r i + v j.",
        "student_5": "Angular momentum is like, you multiply the position and velocity but I’m not sure how. Maybe it’s L = r x v, and since it's anticlockwise, the direction is probably to the right or left?"
    },
    "Q7_41D": {
        "student_1": "I think the magnetic moment is like current times area, right? So, m = I x A, but I'm not sure how to find I. Maybe it’s just the charge per second, so m = (e / T) x (pi x r^2), but I can't remember how to calculate T.",
        "student_2": "Angular momentum L should be something with mass, velocity, and radius I think. Maybe it’s L = m_e x v x r, like mass times velocity times radius. Not sure if it's plus or cross product.",
        "student_3": "The angular momentum is going anticlockwise, so it must be pointing down along the z-axis because it’s opposite the rotation direction, I guess.",
        "student_4": "To calculate L as a vector, I think you just multiply r and v, so L = r i * v j, which maybe equals r*v. I don't know how to make it a vector from there.",
        "student_5": "Magnetic moment as a vector, maybe it’s like angular momentum but with the charge involved? So, maybe m = q x L? But I'm not sure how the units work or why it’s a vector.",
        "student_6": "Using L from before, I think m is something like L divided by mass, so m = L / m_e, but I'm not sure if that's right. It’s a vector because L is a vector, right?"
    },
    "Q7_42": {
        "student_1": "The dot product is used here because it’s the product of two vectors. I think we use it because we want to multiply vectors.",
        "student_2": "The minus sign is there because it’s always in these physics formulas to make things negative. It means the energy is going away or getting less",
        "student_3": "We use a dot product because it gives us one number instead of another vector, which is easier to use. And the minus is there to show the energy is opposite to the magnetic field direction",
        "student_4": "I think dot product is used to figure out the alignment of the magnetic moment with the magnetic field, like how parallel they are. The minus sign is because the energy is lower when they line up",
        "student_5": "the dot product is there because we're adding up how much one vector goes into the other. And the minus sign is just a standard thing in physics to indicate a specific direction"
    },
    "Q7_43": {
        "student_1": "The energy of the photon is equal to the energy difference between the two levels.",
        "student_2": "modify the energy because the magnetic field forces the hydrogen atom to heat up",
        "student_3": "modify the energy because a photon is absorbed by the hydrogen atom. We then need to add the photon energy to the equation for the energy in the schrodinger equation",
        "student_4": "To modify the energy, we just add the potential energy to the old energy. So the total energy is like, kinetic energy plus potential energy from the magnetic field.",
        "student_5": "The Hamiltonian operator now is the old Hamiltonian plus something with the angular momentum? Maybe \\\\( \\\\hat{H} = \\\\hat{H_0} + \\\\hat{L}_z \\)",
        "student_6": "The Schrödinger equation without the magnetic field is just $( \\\\hat{H_0} \\\\psi = E \\\\psi \\)$, right? I think that’s how you write it using the equation from the book.",
        "student_7": "With the magnetic field, the energy probably includes this $( \\\\beta_B )$ thing because it involves the electron's charge and stuff. So the energy is $( E = \\\\hat{H_0} + \\\\beta_B \\\\hat{L}_z \\\\psi)$.",
        "student_8": "We modify the energy by adding the magnetic potential energy. Each term in the Hamiltonian represents a different type of energy: kinetic from $( \\\\hat{H_0} )$ and magnetic from $( \\\\beta_B \\\\hat{L}_z )$."
    }
}